# 35. 単語の出現頻度
# 文章中に出現する単語とその出現頻度を求め，出現頻度の高い順に並べよ．

import pickle
import collections

from ipdb import set_trace as st

if __name__ == "__main__":

    with open('neko_list', mode="rb") as f:
        neko_list = pickle.load(f)

    word_list = []
    word_list = [morphs[0] for morphs in neko_list]
    
    c = collections.Counter(word_list)
    print(c)
    # Counter({'の': 9194, '。': 7486, 'て': 6868, '、': 6772, 'は': 6420, 'に': 6243, 'を': 6071, 'と': 5508, 'が': 5337, 'た': 3988, 'で': 3806, '「': 3231, '」': 3225, 'も': 2479, 'ない': 2390, 'だ': 2363, 'し': 2322, 'から': 2032, 'ある': 1728, 'な': 1613, 'ん': 1568, 'か': 1530, 'いる': 1249, '事': 1207, 'へ': 1034, 'う': 992, 'する': 992, 'もの': 981, '君': 973, 'です': 973, '云う': 937, '主人': 932, 'よう': 696, 'ね': 683, 'この': 649, '御': 636, 'ば': 617, '人': 602, 'その': 576, '一': 554, 'そう': 546, '何': 539, 'なる': 531, 'さ': 514, 'よ': 509, 'なら': 483, '吾輩': 481, 'い': 478, 'ます': 458, 'じゃ': 448, '…': 433, 'これ': 414, ' ': 411, 'なっ': 404, 'それ': 381, '来': 364, 'れ': 356, '見': 350, 'でも': 346, '時': 345, '迷亭': 343, 'ませ': 330, 'いい': 320,
